zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PBCFG_A_Registers.h
#define SI32_PBCFG_A_CONTROL0_PGDONEF_MASK  0x80000000
#define SI32_PBCFG_A_CONTROL0_PGDONEF_SHIFT  31
// Firmware has written to the PBPGPHASE register, but the Pulse Generator timer
// has not expired.
#define SI32_PBCFG_A_CONTROL0_PGDONEF_NOT_SET_VALUE  0U
#define SI32_PBCFG_A_CONTROL0_PGDONEF_NOT_SET_U32 \
   (SI32_PBCFG_A_CONTROL0_PGDONEF_NOT_SET_VALUE << SI32_PBCFG_A_CONTROL0_PGDONEF_SHIFT)
// The Pulse Generator cycle finished since the last time PBPGPHASE was written.
#define SI32_PBCFG_A_CONTROL0_PGDONEF_SET_VALUE  1U
#define SI32_PBCFG_A_CONTROL0_PGDONEF_SET_U32 \
   (SI32_PBCFG_A_CONTROL0_PGDONEF_SET_VALUE << SI32_PBCFG_A_CONTROL0_PGDONEF_SHIFT)



struct SI32_PBCFG_A_CONTROL1_Struct
{
   union
   {
      struct
      {
         // JTAG Enable
         volatile uint32_t JTAGEN: 1;
         // ETM Enable
         volatile uint32_t ETMEN: 1;
                  uint32_t reserved0: 5;
         // EMIF <overline>BE0</overline> Pin Enable
         volatile uint32_t EMIFBE0BEN: 1;
         // EMIF CS1 Pin Enable
         volatile uint32_t EMIFCS1EN: 1;
         // EMIF Enable
         volatile uint32_t EMIFEN: 1;
         // EMIF Width
         volatile uint32_t EMIFWIDTH: 6;
         // Match Mode
         volatile uint32_t MATMD: 2;
                  uint32_t reserved1: 5;
         // External Regulator Reset Mode
         volatile uint32_t EVREGRMD: 1;
                  uint32_t reserved2: 7;
         // Port Bank Configuration Lock
         volatile uint32_t LOCK: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_CONTROL1_JTAGEN_MASK  0x00000001
#define SI32_PBCFG_A_CONTROL1_JTAGEN_SHIFT  0
// JTAG functionality is not pinned out.
#define SI32_PBCFG_A_CONTROL1_JTAGEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_JTAGEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_JTAGEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_JTAGEN_SHIFT)
// JTAG functionality is pinned out.
#define SI32_PBCFG_A_CONTROL1_JTAGEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_JTAGEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_JTAGEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_JTAGEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_ETMEN_MASK  0x00000002
#define SI32_PBCFG_A_CONTROL1_ETMEN_SHIFT  1
// ETM not pinned out.
#define SI32_PBCFG_A_CONTROL1_ETMEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_ETMEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_ETMEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_ETMEN_SHIFT)
// ETM is enabled and pinned out.
#define SI32_PBCFG_A_CONTROL1_ETMEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_ETMEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_ETMEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_ETMEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_MASK  0x00000080
#define SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_SHIFT  7
// Disable the EMIF /BE0 pin.
#define SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_SHIFT)
// Enable the /BE0 pin if EMIFEN is also set to 1.
#define SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_EMIFBE0BEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_EMIFCS1EN_MASK  0x00000100
#define SI32_PBCFG_A_CONTROL1_EMIFCS1EN_SHIFT  8
// Disable the EMIF CS1 pin.
#define SI32_PBCFG_A_CONTROL1_EMIFCS1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_EMIFCS1EN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFCS1EN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_EMIFCS1EN_SHIFT)
// Enable the CS1 pin if EMIFEN is also set to 1.
#define SI32_PBCFG_A_CONTROL1_EMIFCS1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_EMIFCS1EN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFCS1EN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_EMIFCS1EN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_EMIFEN_MASK  0x00000200
#define SI32_PBCFG_A_CONTROL1_EMIFEN_SHIFT  9
// Disable the EMIF pins.
#define SI32_PBCFG_A_CONTROL1_EMIFEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_EMIFEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_EMIFEN_SHIFT)
// EMIF is enabled and pinned out.
#define SI32_PBCFG_A_CONTROL1_EMIFEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_EMIFEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_EMIFEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_MASK  0x0000FC00
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT  10
// Non-Muxed: 0 address lines. Muxed: 8 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_8_VALUE  0
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_8_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_8_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 1 address lines. Muxed: 9 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_9_VALUE  1
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_9_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_9_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 2 address lines. Muxed: 10 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_10_VALUE  2
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_10_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_10_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 3 address lines. Muxed: 11 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_11_VALUE  3
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_11_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_11_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 4 address lines. Muxed: 12 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_12_VALUE  4
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_12_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_12_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 5 address lines. Muxed: 13 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_13_VALUE  5
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_13_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_13_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 6 address lines. Muxed: 14 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_14_VALUE  6
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_14_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_14_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 7 address lines. Muxed: 15 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_15_VALUE  7
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_15_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_15_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 8 address lines. Muxed: 16 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_16_VALUE  8
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_16_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_16_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 9 address lines. Muxed: 17 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_17_VALUE  9
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_17_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_17_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 10 address lines. Muxed: 18 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_18_VALUE  10
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_18_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_18_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 11 address lines. Muxed: 19 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_19_VALUE  11
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_19_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_19_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 12 address lines. Muxed: 20 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_20_VALUE  12
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_20_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_20_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 13 address lines. Muxed: 21 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_21_VALUE  13
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_21_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_21_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 14 address lines. Muxed: 22 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_22_VALUE  14
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_22_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_22_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 15 address lines. Muxed: 23 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_23_VALUE  15
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_23_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_23_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)
// Non-Muxed: 16 address lines. Muxed: 24 address lines.
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_24_VALUE  16
#define SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_24_U32 \
   (SI32_PBCFG_A_CONTROL1_EMIFWIDTH_AWIDTH_24_VALUE << SI32_PBCFG_A_CONTROL1_EMIFWIDTH_SHIFT)

