zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PBCFG_A_Registers.h
#define SI32_PBCFG_A_XBAR0L_CMP1AEN_MASK  0x04000000
#define SI32_PBCFG_A_XBAR0L_CMP1AEN_SHIFT  26
// Disable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP1AEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_CMP1AEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP1AEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP1AEN_SHIFT)
// Enable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP1AEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_CMP1AEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP1AEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP1AEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_TMR0CTEN_MASK  0x08000000
#define SI32_PBCFG_A_XBAR0L_TMR0CTEN_SHIFT  27
// Disable TIMER0 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR0CTEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_TMR0CTEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR0CTEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR0CTEN_SHIFT)
// Enable TIMER0 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR0CTEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_TMR0CTEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR0CTEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR0CTEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_TMR0EXEN_MASK  0x10000000
#define SI32_PBCFG_A_XBAR0L_TMR0EXEN_SHIFT  28
// Disable TIMER0 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR0EXEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_TMR0EXEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR0EXEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR0EXEN_SHIFT)
// Enable TIMER0 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR0EXEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_TMR0EXEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR0EXEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR0EXEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_TMR1CTEN_MASK  0x20000000
#define SI32_PBCFG_A_XBAR0L_TMR1CTEN_SHIFT  29
// Disable TIMER1 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR1CTEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_TMR1CTEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR1CTEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR1CTEN_SHIFT)
// Enable TIMER1 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR1CTEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_TMR1CTEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR1CTEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR1CTEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_TMR1EXEN_MASK  0x40000000
#define SI32_PBCFG_A_XBAR0L_TMR1EXEN_SHIFT  30
// Disable TIMER1 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR1EXEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_TMR1EXEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR1EXEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR1EXEN_SHIFT)
// Enable TIMER1 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_TMR1EXEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_TMR1EXEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_TMR1EXEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_TMR1EXEN_SHIFT)



struct SI32_PBCFG_A_XBAR0H_Struct
{
   union
   {
      struct
      {
         // UART0 Enable
         volatile uint32_t UART0EN: 1;
         // UART0 Flow Control Enable
         volatile uint32_t UART0FCEN: 1;
         // UART1 Enable
         volatile uint32_t UART1EN: 1;
         // SPI1 Enable
         volatile uint32_t SPI1EN: 1;
         // SPI1 NSS Pin Enable
         volatile uint32_t SPI1NSSEN: 1;
         // SPI2 Enable
         volatile uint32_t SPI2EN: 1;
         // SPI2 NSS Pin Enable
         volatile uint32_t SPI2NSSEN: 1;
         // AHB Clock Output Enable
         volatile uint32_t AHBEN: 1;
                  uint32_t reserved0: 23;
         // Crossbar 0 Enable
         volatile uint32_t XBAR0EN: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_XBAR0H_UART0EN_MASK  0x00000001
#define SI32_PBCFG_A_XBAR0H_UART0EN_SHIFT  0
// Disable UART0 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_UART0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_UART0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_UART0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_UART0EN_SHIFT)
// Enable UART0 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_UART0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_UART0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_UART0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_UART0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0H_UART0FCEN_MASK  0x00000002
#define SI32_PBCFG_A_XBAR0H_UART0FCEN_SHIFT  1
// Disable UART0 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_UART0FCEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_UART0FCEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_UART0FCEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_UART0FCEN_SHIFT)
// Enable UART0 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_UART0FCEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_UART0FCEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_UART0FCEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_UART0FCEN_SHIFT)

#define SI32_PBCFG_A_XBAR0H_UART1EN_MASK  0x00000004
#define SI32_PBCFG_A_XBAR0H_UART1EN_SHIFT  2
// Disable UART1 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_UART1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_UART1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_UART1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_UART1EN_SHIFT)
// Enable UART1 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_UART1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_UART1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_UART1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_UART1EN_SHIFT)

#define SI32_PBCFG_A_XBAR0H_SPI1EN_MASK  0x00000008
#define SI32_PBCFG_A_XBAR0H_SPI1EN_SHIFT  3
// Disable SPI1 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_SPI1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI1EN_SHIFT)
// Enable SPI1 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_SPI1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI1EN_SHIFT)

#define SI32_PBCFG_A_XBAR0H_SPI1NSSEN_MASK  0x00000010
#define SI32_PBCFG_A_XBAR0H_SPI1NSSEN_SHIFT  4
// Disable SPI1 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI1NSSEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_SPI1NSSEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI1NSSEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI1NSSEN_SHIFT)
// Enable SPI1 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI1NSSEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_SPI1NSSEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI1NSSEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI1NSSEN_SHIFT)

