zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PBCFG_A_Registers.h
#define SI32_PBCFG_A_XBAR1_SPI2EN_MASK  0x00000080
#define SI32_PBCFG_A_XBAR1_SPI2EN_SHIFT  7
// Disable SPI2 SCK, MISO, and MOSI on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI2EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_SPI2EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI2EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI2EN_SHIFT)
// Enable SPI2 SCK, MISO, and MOSI on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI2EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_SPI2EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI2EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI2EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_SPI2NSSEN_MASK  0x00000100
#define SI32_PBCFG_A_XBAR1_SPI2NSSEN_SHIFT  8
// Disable SPI2 NSS on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI2NSSEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_SPI2NSSEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI2NSSEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI2NSSEN_SHIFT)
// Enable SPI2 NSS on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI2NSSEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_SPI2NSSEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI2NSSEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI2NSSEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_USART1EN_MASK  0x00000200
#define SI32_PBCFG_A_XBAR1_USART1EN_SHIFT  9
// Disable USART1 RX and TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_USART1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_USART1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_USART1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_USART1EN_SHIFT)
// Enable USART1 RX and TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_USART1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_USART1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_USART1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_USART1EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_USART1FCEN_MASK  0x00000400
#define SI32_PBCFG_A_XBAR1_USART1FCEN_SHIFT  10
// Disable USART1 flow control on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_USART1FCEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_USART1FCEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_USART1FCEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_USART1FCEN_SHIFT)
// Enable USART1 flow control on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_USART1FCEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_USART1FCEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_USART1FCEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_USART1FCEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_USART1CEN_MASK  0x00000800
#define SI32_PBCFG_A_XBAR1_USART1CEN_SHIFT  11
// Disable USART1 clock on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_USART1CEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_USART1CEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_USART1CEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_USART1CEN_SHIFT)
// Enable USART1 clock on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_USART1CEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_USART1CEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_USART1CEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_USART1CEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_UART0EN_MASK  0x00001000
#define SI32_PBCFG_A_XBAR1_UART0EN_SHIFT  12
// Disable UART0 RX and TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_UART0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_UART0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_UART0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_UART0EN_SHIFT)
// Enable UART0 RX and TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_UART0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_UART0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_UART0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_UART0EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_UART0FCEN_MASK  0x00002000
#define SI32_PBCFG_A_XBAR1_UART0FCEN_SHIFT  13
// Disable UART0 flow control on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_UART0FCEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_UART0FCEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_UART0FCEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_UART0FCEN_SHIFT)
// Enable UART0 flow control on Crossbar1.
#define SI32_PBCFG_A_XBAR1_UART0FCEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_UART0FCEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_UART0FCEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_UART0FCEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_I2S0TXEN_MASK  0x00004000
#define SI32_PBCFG_A_XBAR1_I2S0TXEN_SHIFT  14
// Disable I2S0 TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2S0TXEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_I2S0TXEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2S0TXEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_I2S0TXEN_SHIFT)
// Enable I2S0 TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2S0TXEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_I2S0TXEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2S0TXEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_I2S0TXEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_I2C0EN_MASK  0x00008000
#define SI32_PBCFG_A_XBAR1_I2C0EN_SHIFT  15
// Disable I2C0 SDA and SCL on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2C0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_I2C0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2C0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_I2C0EN_SHIFT)
// Enable I2C0 SDA and SCL on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2C0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_I2C0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2C0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_I2C0EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_UART1EN_MASK  0x00010000
#define SI32_PBCFG_A_XBAR1_UART1EN_SHIFT  16
// Disable UART1 RX and TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_UART1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_UART1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_UART1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_UART1EN_SHIFT)
// Enable UART1 RX and TX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_UART1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_UART1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_UART1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_UART1EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_I2S0RXEN_MASK  0x00020000
#define SI32_PBCFG_A_XBAR1_I2S0RXEN_SHIFT  17
// Disable I2S0 RX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2S0RXEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_I2S0RXEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2S0RXEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_I2S0RXEN_SHIFT)
// Enable I2S0 RX on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2S0RXEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_I2S0RXEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2S0RXEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_I2S0RXEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_LPT0OEN_MASK  0x00080000
#define SI32_PBCFG_A_XBAR1_LPT0OEN_SHIFT  19
// Disable LPTIMER0 Output on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_LPT0OEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_LPT0OEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_LPT0OEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_LPT0OEN_SHIFT)
// Enable LPTIMER0 Output on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_LPT0OEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_LPT0OEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_LPT0OEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_LPT0OEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_I2C1EN_MASK  0x00100000
#define SI32_PBCFG_A_XBAR1_I2C1EN_SHIFT  20
// Disable I2C1 SDA and SCL on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2C1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_I2C1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2C1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_I2C1EN_SHIFT)
// Enable I2C1 SDA and SCL on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_I2C1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_I2C1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_I2C1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_I2C1EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_KILLHDEN_MASK  0x00200000
#define SI32_PBCFG_A_XBAR1_KILLHDEN_SHIFT  21
// Disable the PB High Drive Kill Pin on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_KILLHDEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_KILLHDEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_KILLHDEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_KILLHDEN_SHIFT)
// Enable the PB High Drive Kill Pin on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_KILLHDEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_KILLHDEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_KILLHDEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_KILLHDEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_XBAR1EN_MASK  0x80000000
#define SI32_PBCFG_A_XBAR1_XBAR1EN_SHIFT  31
// Disable Crossbar 1.
#define SI32_PBCFG_A_XBAR1_XBAR1EN_DISABLED_VALUE  0U
#define SI32_PBCFG_A_XBAR1_XBAR1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_XBAR1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_XBAR1EN_SHIFT)
// Enable Crossbar 1.
#define SI32_PBCFG_A_XBAR1_XBAR1EN_ENABLED_VALUE  1U
#define SI32_PBCFG_A_XBAR1_XBAR1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_XBAR1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_XBAR1EN_SHIFT)



struct SI32_PBCFG_A_PBKEY_Struct
{
   union
   {
      struct
      {
         // Port Bank 2, 3, and 4 Key
         volatile uint8_t KEY;
                  uint32_t reserved0: 24;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_PBKEY_KEY_MASK  0x000000FF
#define SI32_PBCFG_A_PBKEY_KEY_SHIFT  0
// Port Bank 2, 3, and 4 registers are locked and no valid values have been written
// to PBKEY.
#define SI32_PBCFG_A_PBKEY_KEY_LOCKED_VALUE  0
#define SI32_PBCFG_A_PBKEY_KEY_LOCKED_U32 \
   (SI32_PBCFG_A_PBKEY_KEY_LOCKED_VALUE << SI32_PBCFG_A_PBKEY_KEY_SHIFT)
// Port Bank 2, 3, and 4 registers are locked and the first valid value (0xA5) has
// been written to PBKEY.
#define SI32_PBCFG_A_PBKEY_KEY_INTERMEDIATE_VALUE  1
#define SI32_PBCFG_A_PBKEY_KEY_INTERMEDIATE_U32 \
   (SI32_PBCFG_A_PBKEY_KEY_INTERMEDIATE_VALUE << SI32_PBCFG_A_PBKEY_KEY_SHIFT)
// Port Bank 2, 3, and 4 registers are unlocked. Any subsequent writes to the Port
// Bank 2, 3, or 4 registers or PBKEY will lock the interface.
#define SI32_PBCFG_A_PBKEY_KEY_UNLOCKED_VALUE  2
#define SI32_PBCFG_A_PBKEY_KEY_UNLOCKED_U32 \
   (SI32_PBCFG_A_PBKEY_KEY_UNLOCKED_VALUE << SI32_PBCFG_A_PBKEY_KEY_SHIFT)



typedef struct SI32_PBCFG_A_Struct
{
   struct SI32_PBCFG_A_CONTROL0_Struct             CONTROL0       ; // Base Address + 0x0
   volatile uint32_t                               CONTROL0_SET;
   volatile uint32_t                               CONTROL0_CLR;
   uint32_t                                        reserved0;
   struct SI32_PBCFG_A_CONTROL1_Struct             CONTROL1       ; // Base Address + 0x10
   volatile uint32_t                               CONTROL1_SET;
   volatile uint32_t                               CONTROL1_CLR;
   uint32_t                                        reserved1;
   struct SI32_PBCFG_A_XBAR0L_Struct               XBAR0L         ; // Base Address + 0x20
   volatile uint32_t                               XBAR0L_SET;
   volatile uint32_t                               XBAR0L_CLR;
   uint32_t                                        reserved2;
   struct SI32_PBCFG_A_XBAR0H_Struct               XBAR0H         ; // Base Address + 0x30
   volatile uint32_t                               XBAR0H_SET;
   volatile uint32_t                               XBAR0H_CLR;
   uint32_t                                        reserved3;
   struct SI32_PBCFG_A_XBAR1_Struct                XBAR1          ; // Base Address + 0x40
   volatile uint32_t                               XBAR1_SET;
   volatile uint32_t                               XBAR1_CLR;
   uint32_t                                        reserved4;
   struct SI32_PBCFG_A_PBKEY_Struct                PBKEY          ; // Base Address + 0x50
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   uint32_t                                        reserved7;
} SI32_PBCFG_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_PBCFG_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

